from math import degrees


testing_items = {
    "calls":
    [
        {
            "call_num": 1,
            "begin_time": "9:00",
            "end_time": "10:30",
            "id": 1
        },
        {
            "call_num": 2,
            "begin_time": "10:40",
            "end_time": "12:10",
            "id": 2
        },
        {
            "call_num": 3,
            "begin_time": "12:40",
            "end_time": "14:10",
            "id": 3
        },
        {
            "call_num": 4,
            "begin_time": "14:20",
            "end_time": "15:50",
            "id": 4
        },
        {
            "call_num": 5,
            "begin_time": "16:20",
            "end_time": "17:50",
            "id": 5
        },
        {
            "call_num": 6,
            "begin_time": "18:00",
            "end_time": "19:30",
            "id": 6
        },
        {
            "call_num": 7,
            "begin_time": "19:40",
            "end_time": "21:10",
            "id": 7
        },
        {
            "call_num": 7,
            "begin_time": "18:30",
            "end_time": "20:00",
            "id": 8
        },
        {
            "call_num": 8,
            "begin_time": "20:10",
            "end_time": "21:40",
            "id": 9
        }
    ],
    "degrees":
    [
        {
            "name": "Бакалавриат",
            "id": 1
        },
        {
            "name": "Магистратура",
            "id": 2
        },
        {
            "name": "Специалитет",
            "id": 3
        }
    ],
    "disciplines":
    [
        {
            "name": "Правоведение",
            "id": 1
        },
        {
            "name": "Начертательная геометрия инженерная и компьютерная графика",
            "id": 2
        },
        {
            "name": "Линейная алгебра и аналитическая геометрия",
            "id": 3
        },
        {
            "name": "Физика",
            "id": 4
        },
        {
            "name": "Математическая логика и теория алгоритмов",
            "id": 5
        },
        {
            "name": "Ознакомительная практика",
            "id": 6
        },
        {
            "name": "Математический анализ",
            "id": 7
        },
        {
            "name": "Иностранный язык",
            "id": 8
        },
        {
            "name": "Физическая культура и спорт",
            "id": 9
        },
        {
            "name": "Объектно-ориентированное программирование",
            "id": 10
        },
        {
            "name": "Схемотехника устройств компьютерных систем",
            "id": 11
        },
        {
            "name": "Разработка предметно-ориентированных языков программирования",
            "id": 12
        },
        {
            "name": "Проектирование баз данных",
            "id": 13
        },
        {
            "name": "Анализ и концептуальное моделирование систем",
            "id": 14
        },
        {
            "name": "Программирование на языке Питон",
            "id": 15
        }
    ]
}
